{
  "version": "0.0.70",
  "url": "https://github.com/komponentastudio/remote-updates-hosting/releases/download/v0.0.70/Remote-0.0.70-arm64-mac.zip",
  "releaseDate": "2026-01-26T22:43:10.119Z",
  "notes": "<h3>🎬 Dual-Stream Screen Share</h3>\n<ul>\n    <li><b>See Both Camera + Screen</b>: Now you can see the presenter's face in their bubble/tile AND their shared screen at the same time.</li>\n    <li><b>No More Avatar</b>: Presenter's camera is now visible in the sidebar during screen share instead of just their avatar.</li>\n    <li><b>Late Joiner Support</b>: Users joining a call with active screen share now see it immediately.</li>\n</ul>\n<h3>🔧 Permission Debug Tools</h3>\n<ul>\n    <li><b>Test Screen Capture</b>: Verify screen sharing works by seeing all available screens and windows with thumbnails.</li>\n    <li><b>Test Active App Detection</b>: See live updates of which app is currently detected, with debug info to troubleshoot issues.</li>\n    <li><b>Dev Mode Help</b>: Clear warnings explain that in development, you need to grant permissions to your IDE, not just Remote.</li>\n</ul>\n<h3>😊 Improved Emoji Picker</h3>\n<ul>\n    <li><b>Frequent Emojis</b>: Your most-used emojis now appear at the top for quick access.</li>\n    <li><b>Cleaner UI</b>: Removed section headers for a cleaner, more modern look.</li>\n    <li><b>Better Navigation</b>: Category icons automatically highlight as you scroll through emojis.</li>\n    <li><b>Clear Search</b>: Quick X button to clear your search.</li>\n    <li><b>No Scrollbars</b>: Cleaner interface with hidden scrollbars - scroll with trackpad or mouse wheel.</li>\n</ul>\n<h3>🐛 Bug Fixes</h3>\n<ul>\n    <li><b>GIF Scrolling</b>: Fixed issues with scrolling and dragging in GIF tab.</li>\n    <li><b>State Reset</b>: Picker now properly resets when switching tabs or leaving rooms.</li>\n    <li><b>Room Switching</b>: Fixed stability issues when switching between rooms - no more getting stuck or duplicate leave operations.</li>\n    <li><b>1to1 Calls</b>: Fixed issue where 1to1 rooms would remain visible after ending call during ringing phase.</li>\n    <li><b>Auth Stability</b>: Improved handling of temporary authentication state changes that were causing permission errors.</li>\n</ul>\n<h3>🎨 UI Polish</h3>\n<ul>\n    <li><b>Status Selector</b>: Status selector now consistently shows your presence status (Online, DnD, etc.) even during active calls.</li>\n    <li><b>Cleaner Sidebar</b>: Dropdown arrow in status selector now appears on hover, matching other sidebar controls.</li>\n</ul>"
}